mapping = {
    "": "a",
    "": "b",
    "": "c",
    "": "d",
    "": "e",
    "": "f",
    "": "g",
    "": "h",
    "": "i",
    "": "j",
    "": "k",
    "": "l",
    "": "m",
    "": "n",
    "": "o",
    "": "p",
    "": "q",
    "": "r",
    "": "s",
    "": "t",
    "": "u",
    "": "v",
    "": "w",
    "": "x",
    "": "y",
    "": "z"
}




def decode(code):
    return "".join(mapping.get(c, c) for c in code)

def main():
    code = "('H !')"
    decoded = decode(code)
    exec(decoded)

if __name__ == "__main__":
    main()